# Pandas Basics

In [2]:
import pandas as pd

In [3]:
X = pd.read_csv('quakes.csv')
X.head(10)

   id    lat    long  depth  mag  stations
0   1 -20.42  181.62    562  4.8        41
1   2 -20.62  181.03    650  4.2        15
2   3 -26.00  184.10     42  5.4        43
3   4 -17.97  181.66    626  4.1        19
4   5 -20.42  181.96    649  4.0        11
5   6 -19.68  184.31    195  4.0        12
6   7 -11.70  166.10     82  4.8        43
7   8 -28.11  181.93    194  4.4        15
8   9 -28.74  181.74    211  4.7        35
9  10 -17.47  179.59    622  4.3        19

In [4]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
id          1000 non-null int64
lat         1000 non-null float64
long        1000 non-null float64
depth       1000 non-null int64
mag         1000 non-null float64
stations    1000 non-null int64
dtypes: float64(3), int64(3)
memory usage: 47.0 KB

In [5]:
M = X.as_matrix()
type(M)

numpy.ndarray

In [22]:
X['lat'].head()

0   -20.42
1   -20.62
2   -26.00
3   -17.97
4   -20.42
Name: lat, dtype: float64

In [14]:
X.iloc[0]

id            1.00
lat         -20.42
long        181.62
depth       562.00
mag           4.80
stations     41.00
Name: 0, dtype: float64

In [20]:
X.ix[0].head()

id         1.00
lat      -20.42
long     181.62
depth    562.00
mag        4.80
Name: 0, dtype: float64

In [24]:
X[['lat', 'long']].head()

     lat    long
0 -20.42  181.62
1 -20.62  181.03
2 -26.00  184.10
3 -17.97  181.66
4 -20.42  181.96

In [35]:
X[ X['mag'] > 5.0 ].head()

    id    lat    long  depth  mag  stations
2    3 -26.00  184.10     42  5.4        43
14  15 -20.70  169.92    139  6.1        94
16  17 -13.64  165.96     50  6.0        83
24  25 -19.66  180.28    431  5.4        57
27  28 -16.46  180.79    498  5.2        79

In [37]:
X.mag.head()

0    4.8
1    4.2
2    5.4
3    4.1
4    4.0
Name: mag, dtype: float64

In [39]:
X['extra'] = 1
X.head()

   id    lat    long  depth  mag  stations  extra
0   1 -20.42  181.62    562  4.8        41      1
1   2 -20.62  181.03    650  4.2        15      1
2   3 -26.00  184.10     42  5.4        43      1
3   4 -17.97  181.66    626  4.1        19      1
4   5 -20.42  181.96    649  4.0        11      1

In [43]:
X['extra_sqr'] = X.apply(lambda x: x['lat'] * x['long'], axis=1)
X.head()

   id    lat    long  depth  mag  stations  extra  extra_sqr
0   1 -20.42  181.62    562  4.8        41      1 -3708.6804
1   2 -20.62  181.03    650  4.2        15      1 -3732.8386
2   3 -26.00  184.10     42  5.4        43      1 -4786.6000
3   4 -17.97  181.66    626  4.1        19      1 -3264.4302
4   5 -20.42  181.96    649  4.0        11      1 -3715.6232

In [45]:
df_1 = X[['id', 'lat', 'long']]
df_1.head()

   id    lat    long
0   1 -20.42  181.62
1   2 -20.62  181.03
2   3 -26.00  184.10
3   4 -17.97  181.66
4   5 -20.42  181.96

In [46]:
df_2 = X[['id', 'depth', 'mag', 'stations']]
df_2.head()

   id  depth  mag  stations
0   1    562  4.8        41
1   2    650  4.2        15
2   3     42  5.4        43
3   4    626  4.1        19
4   5    649  4.0        11

In [48]:
df_final = pd.merge(df_1, df_2, on='id')
df_final.head()

   id    lat    long  depth  mag  stations
0   1 -20.42  181.62    562  4.8        41
1   2 -20.62  181.03    650  4.2        15
2   3 -26.00  184.10     42  5.4        43
3   4 -17.97  181.66    626  4.1        19
4   5 -20.42  181.96    649  4.0        11